zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal.h
/**
  ******************************************************************************
  * @file    stm32mp2xx_hal.h
  * @author  MCD Application Team
  * @brief   This file contains all the functions prototypes for the HAL
  *          module driver.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32MP2xx_HAL_H
#define __STM32MP2xx_HAL_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32mp2xx_hal_conf.h"

/** @addtogroup STM32MP2xx_HAL_Driver
  * @{
  */

/** @addtogroup HAL
  * @{
  */

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/** @defgroup HAL_Exported_Constants HAL Exported Constants
  * @{
  */
/** @defgroup HDP_Mux HDP Mux
  * @{
  */
#define  HAL_HDP_MUX0                   (HDP_MUX_MUX0)
#define  HAL_HDP_MUX1                   (HDP_MUX_MUX1)
#define  HAL_HDP_MUX2                   (HDP_MUX_MUX2)
#define  HAL_HDP_MUX3                   (HDP_MUX_MUX3)
#define  HAL_HDP_MUX4                   (HDP_MUX_MUX4)
#define  HAL_HDP_MUX5                   (HDP_MUX_MUX5)
#define  HAL_HDP_MUX6                   (HDP_MUX_MUX6)
#define  HAL_HDP_MUX7                   (HDP_MUX_MUX7)
/**
  * @}
 */

/** @defgroup HDP_Signal  HDP Signal
  * @{
  */
/*Signal on HDP0 Mux/signal*/
#define  HAL_HDP_PWR_PWRWAKE_SYS          (0x00000000UL)
#define  HAL_HDP_CPU2_SLEEP_DEEP          (HDP_MUX_MUX0_0)
#define  HAL_HDP_BSEC_OUT_TEST_SDR_UNLOCK (HDP_MUX_MUX0_1)
#define  HAL_HDP_BSEC_OUT_NIDENM          (HDP_MUX_MUX0_1|HDP_MUX_MUX0_0)
#define  HAL_HDP_BSEC_OUT_NIDENA          (HDP_MUX_MUX0_2)
#define  HAL_HDP_CPU2_STATE_0             (HDP_MUX_MUX0_2|HDP_MUX_MUX0_0)
#define  HAL_HDP_RCC_PWRDS_SYS            (HDP_MUX_MUX0_2|HDP_MUX_MUX0_1)
#define  HAL_HDP_GPU_DBG7                 (HDP_MUX_MUX0_2|HDP_MUX_MUX0_1|HDP_MUX_MUX0_0)
#define  HAL_HDP_DDRSS_CSYSREQ_DDRC       (HDP_MUX_MUX0_3)
#define  HAL_HDP_DDRSS_DFI_PHYUPD_REQ     (HDP_MUX_MUX0_3|HDP_MUX_MUX0_0)
#define  HAL_HDP_CPU3_SLEEP_DEEP          (HDP_MUX_MUX0_3|HDP_MUX_MUX0_1)
#define  HAL_HDP_D2_GBL_PER_CLK_BUS_REQ   (HDP_MUX_MUX0_3|HDP_MUX_MUX0_1|HDP_MUX_MUX0_0)
#define  HAL_HDP_PCIE_USB_CXPL_EI_0       (HDP_MUX_MUX0_3|HDP_MUX_MUX0_2)
#define  HAL_HDP_PCIE_USB_CXPL_EI_8       (HDP_MUX_MUX0_3|HDP_MUX_MUX0_2|HDP_MUX_MUX0_0)
#define  HAL_HDP_D3_STATE_0               (HDP_MUX_MUX0_3|HDP_MUX_MUX0_2|HDP_MUX_MUX0_1)
#define  HAL_HDP_GPOVAL_0                 (HDP_MUX_MUX0_3|HDP_MUX_MUX0_2|HDP_MUX_MUX0_1|HDP_MUX_MUX0_0)

/*Signal on HDP1 Mux/signal*/
#define  HAL_HDP_PWR_PWRWAKE_CPU2       (0x00000000UL)
#define  HAL_HDP_CPU2_HALTED            (HDP_MUX_MUX1_0)
#define  HAL_HDP_CPU2_STATE_1           (HDP_MUX_MUX1_1)
#define  HAL_HDP_BSEC_OUT_DBGENM        (HDP_MUX_MUX1_1|HDP_MUX_MUX1_0)
#define  HAL_HDP_BSEC_OUT_DBGENA        (HDP_MUX_MUX1_2)
#define  HAL_HDP_EXTI1_SYS_WAKEUP       (HDP_MUX_MUX1_2|HDP_MUX_MUX1_0)
#define  HAL_HDP_RCC_PWRDS_CPU2         (HDP_MUX_MUX1_2|HDP_MUX_MUX1_1)
#define  HAL_HDP_GPU_DBG6               (HDP_MUX_MUX1_2|HDP_MUX_MUX1_1|HDP_MUX_MUX1_0)
#define  HAL_HDP_DDRSS_CSYSACK_DDRC     (HDP_MUX_MUX1_3)
#define  HAL_HDP_DDRSS_DFI_PHYMSTR_REQ  (HDP_MUX_MUX1_3|HDP_MUX_MUX1_0)
#define  HAL_HDP_CPU3_HALTED            (HDP_MUX_MUX1_3|HDP_MUX_MUX1_1)
#define  HAL_HDP_D2_GBL_PER_DMA_REQ     (HDP_MUX_MUX1_3|HDP_MUX_MUX1_1|HDP_MUX_MUX1_0)
#define  HAL_HDP_PCIE_USB_CXPL_EI_1     (HDP_MUX_MUX1_3|HDP_MUX_MUX1_2)
#define  HAL_HDP_PCIE_USB_CXPL_EI_9     (HDP_MUX_MUX1_3|HDP_MUX_MUX1_2|HDP_MUX_MUX1_0)
#define  HAL_HDP_D3_STATE_1             (HDP_MUX_MUX1_3|HDP_MUX_MUX1_2|HDP_MUX_MUX1_1)
#define  HAL_HDP_GPOVAL_1               (HDP_MUX_MUX1_3|HDP_MUX_MUX1_2|HDP_MUX_MUX1_1|HDP_MUX_MUX1_0)

/*Signal on HDP2 Mux/signal*/
#define  HAL_HDP_PWR_PWRWAKE_CPU1       (0x00000000UL)
#define  HAL_HDP_CPU2_RXEV              (HDP_MUX_MUX2_0)
#define  HAL_HDP_CPU1_NPMUIRQ1          (HDP_MUX_MUX2_1)
#define  HAL_HDP_CPU1_NFIQOUT1          (HDP_MUX_MUX2_1|HDP_MUX_MUX2_0)
#define  HAL_HDP_BSEC_OUT_SHDBGEN       (HDP_MUX_MUX2_2)
#define  HAL_HDP_EXTI1_CPU2_WAKEUP      (HDP_MUX_MUX2_2|HDP_MUX_MUX2_0)
#define  HAL_HDP_RCC_PWRDS_CPU1         (HDP_MUX_MUX2_2|HDP_MUX_MUX2_1)
#define  HAL_HDP_GPU_DBG5               (HDP_MUX_MUX2_2|HDP_MUX_MUX2_1|HDP_MUX_MUX2_0)
#define  HAL_HDP_DDRSS_CACTIVE_DDRC     (HDP_MUX_MUX2_3)
#define  HAL_HDP_DDRSS_DFI_LP_REQ       (HDP_MUX_MUX2_3|HDP_MUX_MUX2_0)
#define  HAL_HDP_CPU3_RXEV              (HDP_MUX_MUX2_3|HDP_MUX_MUX2_1)
#define  HAL_HDP_HPDMA1_CLK_BUS_REQ     (HDP_MUX_MUX2_3|HDP_MUX_MUX2_1|HDP_MUX_MUX2_0)
#define  HAL_HDP_PCIE_USB_CXPL_EI_2     (HDP_MUX_MUX2_3|HDP_MUX_MUX2_2)
#define  HAL_HDP_PCIE_USB_CXPL_EI_10    (HDP_MUX_MUX2_3|HDP_MUX_MUX2_2|HDP_MUX_MUX2_0)
#define  HAL_HDP_D3_STATE_2             (HDP_MUX_MUX2_3|HDP_MUX_MUX2_2|HDP_MUX_MUX2_1)
#define  HAL_HDP_GPOVAL_2               (HDP_MUX_MUX2_3|HDP_MUX_MUX2_2|HDP_MUX_MUX2_1|HDP_MUX_MUX2_0)

/*Signal on HDP3 Mux/signal*/
#define  HAL_HDP_PWR_SEL_VTH_VDDCPU     (0x00000000UL)
#define  HAL_HDP_CPU2_TXEV              (HDP_MUX_MUX3_0)
#define  HAL_HDP_CPU1_NPMUIRQ0          (HDP_MUX_MUX3_1)
#define  HAL_HDP_CPU1_NFIQOUT0          (HDP_MUX_MUX3_1|HDP_MUX_MUX3_0)
#define  HAL_HDP_BSEC_OUT_DDBGEN        (HDP_MUX_MUX3_2)
#define  HAL_HDP_EXTI1_CPU1_WAKEUP      (HDP_MUX_MUX3_2|HDP_MUX_MUX3_0)
#define  HAL_HDP_CPU3_STATE_0           (HDP_MUX_MUX3_2|HDP_MUX_MUX3_1)
#define  HAL_HDP_GPU_DBG4               (HDP_MUX_MUX3_2|HDP_MUX_MUX3_1|HDP_MUX_MUX3_0)
#define  HAL_HDP_DDRSS_MCDCG_EN         (HDP_MUX_MUX3_3)
#define  HAL_HDP_DDRSS_DFI_FREQ_0       (HDP_MUX_MUX3_3|HDP_MUX_MUX3_0)
#define  HAL_HDP_CPU3_TXEV              (HDP_MUX_MUX3_3|HDP_MUX_MUX3_1)
#define  HAL_HDP_HPDMA2_CLK_BUS_REQ     (HDP_MUX_MUX3_3|HDP_MUX_MUX3_1|HDP_MUX_MUX3_0)
#define  HAL_HDP_PCIE_USB_CXPL_EI_3     (HDP_MUX_MUX3_3|HDP_MUX_MUX3_2)
#define  HAL_HDP_PCIE_USB_CXPL_EI_11    (HDP_MUX_MUX3_3|HDP_MUX_MUX3_2|HDP_MUX_MUX3_0)
#define  HAL_HDP_D1_STATE_0             (HDP_MUX_MUX3_3|HDP_MUX_MUX3_2|HDP_MUX_MUX3_1)
/* Value of PWR_CPU1D1SR_DSTATE[1] bitfield */
#define  HAL_HDP_GPOVAL_3               (HDP_MUX_MUX3_3|HDP_MUX_MUX3_2|HDP_MUX_MUX3_1|HDP_MUX_MUX3_0)

/*Signal on HDP4 Mux/signal*/
#define  HAL_HDP_PWR_SEL_VTH_VDDCORE    (0x00000000UL)
#define  HAL_HDP_CPU2_SLEEPING          (HDP_MUX_MUX4_0)
#define  HAL_HDP_CPU1_EVENTO            (HDP_MUX_MUX4_1)
#define  HAL_HDP_CPU1_NIRQOUT1          (HDP_MUX_MUX4_1|HDP_MUX_MUX4_0)
#define  HAL_HDP_BSEC_OUT_SPNIDENA      (HDP_MUX_MUX4_2)
#define  HAL_HDP_EXTI2_D3_WAKEUP        (HDP_MUX_MUX4_2|HDP_MUX_MUX4_0)
#define  HAL_HDP_ETH1_OUT_PMT_INTR_O    (HDP_MUX_MUX4_2|HDP_MUX_MUX4_1)
#define  HAL_HDP_GPU_DBG3               (HDP_MUX_MUX4_2|HDP_MUX_MUX4_1|HDP_MUX_MUX4_0)
#define  HAL_HDP_DDRSS_DPHYCG_EN        (HDP_MUX_MUX4_3)
#define  HAL_HDP_DDRSS_OBSP0            (HDP_MUX_MUX4_3|HDP_MUX_MUX4_0)
#define  HAL_HDP_CPU3_SLEEPING          (HDP_MUX_MUX4_3|HDP_MUX_MUX4_1)
#define  HAL_HDP_HDPMA3_CLK_BUS_REQ      (HDP_MUX_MUX4_3|HDP_MUX_MUX4_1|HDP_MUX_MUX4_0)
#define  HAL_HDP_PCIE_USB_CXPL_EI_4     (HDP_MUX_MUX4_3|HDP_MUX_MUX4_2)
#define  HAL_HDP_PCIE_USB_CXPL_EI_12    (HDP_MUX_MUX4_3|HDP_MUX_MUX4_2|HDP_MUX_MUX4_0)
/* Value of PWR_CPU1D1SR_DSTATE[1] bitfield */
#define  HAL_HDP_D1_STATE_1             (HDP_MUX_MUX4_3|HDP_MUX_MUX4_2|HDP_MUX_MUX4_1)
#define  HAL_HDP_GPOVAL_4               (HDP_MUX_MUX4_3|HDP_MUX_MUX4_2|HDP_MUX_MUX4_1|HDP_MUX_MUX4_0)

