zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal.h
/*Signal on HDP5 Mux/signal*/
#define  HAL_HDP_CPU1_STANDBYWFI_L2     (0x00000000UL)
#define  HAL_HDP_HDP5SIGNAL1_RESERVED   (HDP_MUX_MUX5_0)
#define  HAL_HDP_HDP5SIGNAL2_RESERVED   (HDP_MUX_MUX5_1)
#define  HAL_HDP_CPU1_NIRQOUT0          (HDP_MUX_MUX5_1|HDP_MUX_MUX5_0)
#define  HAL_HDP_BSEC_OUT_SPIDENA       (HDP_MUX_MUX5_2)
#define  HAL_HDP_EXTI2_CPU3_WAKEUP      (HDP_MUX_MUX5_2|HDP_MUX_MUX5_0)
#define  HAL_HDP_ETH1_OUT_LPI_INTR_O    (HDP_MUX_MUX5_2|HDP_MUX_MUX5_1)
#define  HAL_HDP_GPU_DBG2               (HDP_MUX_MUX5_2|HDP_MUX_MUX5_1|HDP_MUX_MUX5_0)
#define  HAL_HDP_DDRSS_DFI_INIT_START   (HDP_MUX_MUX5_3)
#define  HAL_HDP_DDRSS_OBSP1            (HDP_MUX_MUX5_3|HDP_MUX_MUX5_0)
#define  HAL_HDP_CPU3_STATE_1           (HDP_MUX_MUX5_3|HDP_MUX_MUX5_1)
#define  HAL_HDP_D3_GPL_CLK_BUS_REQ     (HDP_MUX_MUX5_3|HDP_MUX_MUX5_1|HDP_MUX_MUX5_0)
#define  HAL_HDP_PCIE_USB_CXPL_EI_5     (HDP_MUX_MUX5_3|HDP_MUX_MUX5_2)
#define  HAL_HDP_PCIE_USB_CXPL_EI_13    (HDP_MUX_MUX5_3|HDP_MUX_MUX5_2|HDP_MUX_MUX5_0)
/* Value of PWR_CPU1D1SR_DSTATE[2] bitfield */
#define  HAL_HDP_D1_STATE_2             (HDP_MUX_MUX5_3|HDP_MUX_MUX5_2|HDP_MUX_MUX5_1)
#define  HAL_HDP_GPOVAL_5               (HDP_MUX_MUX5_3|HDP_MUX_MUX5_2|HDP_MUX_MUX5_1|HDP_MUX_MUX5_0)

/*Signal on HDP6 Mux/signal*/
#define  HAL_HDP_CPU1_STANDBYWFI_1      (0x00000000UL)
#define  HAL_HDP_CPU1_STANDBYWFE_1      (HDP_MUX_MUX6_0)
#define  HAL_HDP_CPU1_HALTED_1          (HDP_MUX_MUX6_1)
#define  HAL_HDP_CPU1_NAXIER_RIRQ       (HDP_MUX_MUX6_1|HDP_MUX_MUX6_0)
#define  HAL_HDP_BSEC_OUT_SPNIDENM      (HDP_MUX_MUX6_2)
#define  HAL_HDP_EXTI2_CPU2_WAKEUP      (HDP_MUX_MUX6_2|HDP_MUX_MUX6_0)
#define  HAL_HDP_ETH2_OUT_PMT_INTR_O    (HDP_MUX_MUX6_2|HDP_MUX_MUX6_1)
#define  HAL_HDP_GPU_DBG1               (HDP_MUX_MUX6_2|HDP_MUX_MUX6_1|HDP_MUX_MUX6_0)
#define  HAL_HDP_DDRSS_DFI_INIT_CMPLT   (HDP_MUX_MUX6_3)
#define  HAL_HDP_DDRSS_OBSP2            (HDP_MUX_MUX6_3|HDP_MUX_MUX6_0)
#define  HAL_HDP_D2_STATE_0             (HDP_MUX_MUX6_3|HDP_MUX_MUX6_1)
#define  HAL_HDP_D3_GPL_PER_DMA_REQ     (HDP_MUX_MUX6_3|HDP_MUX_MUX6_1|HDP_MUX_MUX6_0)
#define  HAL_HDP_PCIE_USB_CXPL_EI_6     (HDP_MUX_MUX6_3|HDP_MUX_MUX6_2)
#define  HAL_HDP_PCIE_USB_CXPL_EI_14    (HDP_MUX_MUX6_3|HDP_MUX_MUX6_2|HDP_MUX_MUX6_0)
/* Value of PWR_CPU1D1SR_CSTATE[0] bitfield */
#define  HAL_HDP_CPU1_STATE_0           (HDP_MUX_MUX6_3|HDP_MUX_MUX6_2|HDP_MUX_MUX6_1)
#define  HAL_HDP_GPOVAL_6               (HDP_MUX_MUX6_3|HDP_MUX_MUX6_2|HDP_MUX_MUX6_1|HDP_MUX_MUX6_0)

/*Signal on HDP7 Mux/signal*/
#define  HAL_HDP_CPU1_STANDBYWFI_0      (0x00000000UL)
#define  HAL_HDP_CPU1_STANDBYWFE_0      (HDP_MUX_MUX7_0)
#define  HAL_HDP_CPU1_HALTED_0          (HDP_MUX_MUX7_1)
#define  HAL_HDP_HDP7SIGNAL3_RESERVED   (HDP_MUX_MUX7_1|HDP_MUX_MUX7_0)
#define  HAL_HDP_BSEC_OUT_SPIDENM       (HDP_MUX_MUX7_2)
#define  HAL_HDP_EXTI2_CPU1_WAKEUP      (HDP_MUX_MUX7_2|HDP_MUX_MUX7_0)
#define  HAL_HDP_ETH2_OUT_LPI_INTR_O    (HDP_MUX_MUX7_2|HDP_MUX_MUX7_1)
#define  HAL_HDP_GPU_DBG0               (HDP_MUX_MUX7_2|HDP_MUX_MUX7_1|HDP_MUX_MUX7_0)
#define  HAL_HDP_DDRSS_DFI_CTRLUPD_REQ  (HDP_MUX_MUX7_3)
#define  HAL_HDP_DDRSS_OBSP3            (HDP_MUX_MUX7_3|HDP_MUX_MUX7_0)
#define  HAL_HDP_D2_STATE_1             (HDP_MUX_MUX7_3|HDP_MUX_MUX7_1)
#define  HAL_HDP_LPDMA_CLK_BUS_REQ      (HDP_MUX_MUX7_3|HDP_MUX_MUX7_1|HDP_MUX_MUX7_0)
#define  HAL_HDP_PCIE_USB_CXPL_EI_7     (HDP_MUX_MUX7_3|HDP_MUX_MUX7_2)
#define  HAL_HDP_PCIE_USB_CXPL_EI_15    (HDP_MUX_MUX7_3|HDP_MUX_MUX7_2|HDP_MUX_MUX7_0)
/* Value of PWR_CPU1D1SR_CSTATE[1:0] bitfield */
#define  HAL_HDP_CPU1_STATE_1           (HDP_MUX_MUX7_3|HDP_MUX_MUX7_2|HDP_MUX_MUX7_1)
#define  HAL_HDP_GPOVAL_7               (HDP_MUX_MUX7_3|HDP_MUX_MUX7_2|HDP_MUX_MUX7_1|HDP_MUX_MUX7_0)

/**
  * @}
  */


/** @defgroup SYSCFG_Ethernet_Config  SYSCFG Ethernet Config
  * @{
  */

/*!< Select the Media Independent Interface */
#define SYSCFG_ETH_MII                      (0x0U << SYSCFG_ETH1CR_ETH1_SEL_Pos)

/*!< Select the reduced gigabit media-independent interface*/
#define SYSCFG_ETH_RGMII                    (0x1U << SYSCFG_ETH1CR_ETH1_SEL_Pos)

/*!< Select the Reduced Media Independent Interface */
#define SYSCFG_ETH_RMII                     (0x4U << SYSCFG_ETH1CR_ETH1_SEL_Pos)

#define IS_SYSCFG_ETHERNET_CONFIG(CONFIG) (((CONFIG) == SYSCFG_ETH_MII) || \
                                           ((CONFIG) == SYSCFG_ETH_RGMII) || \
                                           ((CONFIG) == SYSCFG_ETH_RMII))

/*!< Select the External clock */
#define SYSCFG_ETH_EXT_CLK                  (0x0U << SYSCFG_ETH1CR_ETH1_CLK_SEL_Pos)

/*!< Select the RCC Internal Clock */
#define SYSCFG_ETH_RCC_CLK                  (0x1U << SYSCFG_ETH1CR_ETH1_CLK_SEL_Pos)
#define SYSCFG_ETH_RCC_REF_CLK              (0x1U << SYSCFG_ETH1CR_ETH1_REF_CLK_SEL_Pos)

#define IS_SYSCFG_ETHERNET_CLOCK_CONFIG(CONFIG) (((CONFIG) == SYSCFG_ETH_EXT_CLK) || \
                                                 ((CONFIG) == SYSCFG_ETH_RCC_CLK))

/**
  * @}
  */

#if defined(SYSCFG_IOCR_HSLVEN_TRACE)
/** @defgroup SYSCFG_Analog_Switch_Config SYSCFG Analog Switch Config
  * @{
  */
#define SYSCFG_SWITCH_PA0                            SYSCFG_IOCR_ANA0_SEL  /*!< Select PA0 analog switch */
#define SYSCFG_SWITCH_PA1                            SYSCFG_IOCR_ANA1_SEL  /*!< Select PA1 analog switch */

#define IS_SYSCFG_ANALOG_SWITCH(SWITCH)               ((((SWITCH) & SYSCFG_SWITCH_PA0) == SYSCFG_SWITCH_PA0)|| \
                                                       (((SWITCH) & SYSCFG_SWITCH_PA1) == SYSCFG_SWITCH_PA1))

#define SYSCFG_SWITCH_PA0_OPEN                       SYSCFG_IOCR_ANA0_SEL       /*!<  ANA0 internally connected to PA0 */
#define SYSCFG_SWITCH_PA0_CLOSE                      ((uint32_t)0x00000000)         /*!< PA0 analog is not connected */
#define SYSCFG_SWITCH_PA1_OPEN                       SYSCFG_IOCR_ANA1_SEL       /*!<  ANA1 internally connected to PA1 */
#define SYSCFG_SWITCH_PA1_CLOSE                      ((uint32_t)0x00000000)         /*!< PA1 is not connected*/

