zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal.h
#define IS_SYSCFG_SWITCH_STATE(STATE)       ((((STATE) & SYSCFG_SWITCH_PA0_OPEN) == SYSCFG_SWITCH_PA0_OPEN)    || \
                                             (((STATE) & SYSCFG_SWITCH_PA0_CLOSE) == SYSCFG_SWITCH_PA0_CLOSE)  || \
                                             (((STATE) & SYSCFG_SWITCH_PA1_OPEN) == SYSCFG_SWITCH_PA1_OPEN)    || \
                                             (((STATE) & SYSCFG_SWITCH_PA1_CLOSE) == SYSCFG_SWITCH_PA1_CLOSE))
/**
  * @}
  */

/** @defgroup SYSCFG_IOControl_HSpeed_Config SYSCFG IOControl HighSpeed Config
  * @{
  */
#define SYSCFG_HIGHSPEED_TRACE_SIGNAL             SYSCFG_IOCR_HSLVEN_TRACE       /*!< High Speed Low Voltage Pad mode Enable when a TRACEx signal is selected in AFMUX */
#define SYSCFG_HIGHSPEED_LCD_SIGNAL               SYSCFG_IOCR_HSLVEN_LCD         /*!< High Speed Low Voltage Pad mode Enable when a LCDx signal is selected in AFMUX */
#define SYSCFG_HIGHSPEED_OCTOSPIM_P1_SIGNAL       SYSCFG_IOCR_HSLVEN_OCTOSPIM_P1 /*!< High Speed Low Voltage Pad mode Enable when a OCTOSPIM_P1_x signal is selected in AFMUX */
#define SYSCFG_HIGHSPEED_OCTOSPIM_P2_SIGNAL       SYSCFG_IOCR_HSLVEN_OCTOSPIM_P2 /*!< High Speed Low Voltage Pad mode Enable when a OCTOSPIM_P2_x signal is selected in AFMUX */
#define SYSCFG_HIGHSPEED_ETH1_SIGNAL              SYSCFG_IOCR_HSLVEN_ETH1        /*!< High Speed Low Voltage Pad mode Enable when a ETH1_x signal is selected in AFMUX */
#define SYSCFG_HIGHSPEED_ETH2_SIGNAL              SYSCFG_IOCR_HSLVEN_ETH2        /*!< High Speed Low Voltage Pad mode Enable when a ETH2_x signal is selected in AFMUX */
#define SYSCFG_HIGHSPEED_ETH3_SIGNAL              SYSCFG_IOCR_HSLVEN_ETH3        /*!< High Speed Low Voltage Pad mode Enable when a ETH3_x signal is selected in AFMUX */
#define SYSCFG_HIGHSPEED_SDMMC3_SIGNAL            SYSCFG_IOCR_HSLVEN_SDMMC3      /*!< High Speed Low Voltage Pad mode Enable when a SDMMC3_x signal is selected in AFMUX */
#define SYSCFG_HIGHSPEED_SPI1_SIGNAL              SYSCFG_IOCR_HSLVEN_SPI1        /*!< High Speed Low Voltage Pad mode Enable when a SPI1_x signal is selected in AFMUX */
#define SYSCFG_HIGHSPEED_SPI2_SIGNAL              SYSCFG_IOCR_HSLVEN_SPI2        /*!< High Speed Low Voltage Pad mode Enable when a SPI2_x signal is selected in AFMUX */
#define SYSCFG_HIGHSPEED_SPI3_SIGNAL              SYSCFG_IOCR_HSLVEN_SPI3        /*!< High Speed Low Voltage Pad mode Enable when a SPI3_x signal is selected in AFMUX */
#define SYSCFG_HIGHSPEED_SPI4_SIGNAL              SYSCFG_IOCR_HSLVEN_SPI4        /*!< High Speed Low Voltage Pad mode Enable when a SPI4_x signal is selected in AFMUX */
#define SYSCFG_HIGHSPEED_SPI5_SIGNAL              SYSCFG_IOCR_HSLVEN_SPI5        /*!< High Speed Low Voltage Pad mode Enable when a SPI5_x signal is selected in AFMUX */
#define SYSCFG_HIGHSPEED_SPI6_SIGNAL              SYSCFG_IOCR_HSLVEN_SPI6        /*!< High Speed Low Voltage Pad mode Enable when a SPI6_x signal is selected in AFMUX */
#define SYSCFG_HIGHSPEED_SPI7_SIGNAL              SYSCFG_IOCR_HSLVEN_SPI7        /*!< High Speed Low Voltage Pad mode Enable when a SPI7_x signal is selected in AFMUX */
#define SYSCFG_HIGHSPEED_SPI8_SIGNAL              SYSCFG_IOCR_HSLVEN_SPI8        /*!< High Speed Low Voltage Pad mode Enable when a SPI8_x signal is selected in AFMUX */
#define SYSCFG_HIGHSPEED_DCMI_PSSI_DCMIPP_SIGNAL  SYSCFG_IOCR_HSLVEN_DCMI_PSSI   /*!< High Speed Low Voltage Pad mode Enable when a DCMI_PSSI_DCMIPP_x signal is selected in AFMUX */
/**
  * @}
  */
#endif /* SYSCFG_IOCR_HSLVEN_TRACE */

/** @defgroup SYSCFG_Lock_items SYSCFG Lock items
  * @brief SYSCFG items to set lock on
  * @{
  */
#define SYSCFG_NONE                    (0x0U)
#define SYSCFG_SAU                     SYSCFG_M33SSCR_LOCKSAU
#define SYSCFG_MPU_SEC                 SYSCFG_M33SSCR_LOCKSMPU
#define SYSCFG_MPU_NSEC                SYSCFG_M33SSCR_LOCKNSMPU
#define SYSCFG_VTOR_NSEC               SYSCFG_M33SSCR_LOCKNSVTOR
#define SYSCFG_VTOR_AIRCR_SEC          SYSCFG_M33SSCR_LOCKSVTAIRCR
#define SYSCFG_LOCK_ALL                (SYSCFG_MPU_NSEC|SYSCFG_VTOR_NSEC|SYSCFG_SAU|\
                                        SYSCFG_MPU_SEC|SYSCFG_VTOR_AIRCR_SEC)  /*!< All */

#define IS_SYSCFG_LOCK_SELECT(SELECT)  ((((SELECT)) == SYSCFG_NONE)|| \
                                        (((SELECT) & SYSCFG_SAU) == SYSCFG_SAU)|| \
                                        (((SELECT) & SYSCFG_MPU_SEC) == SYSCFG_MPU_SEC)|| \
                                        (((SELECT) & SYSCFG_MPU_NSEC) == SYSCFG_MPU_NSEC)|| \
                                        (((SELECT) & SYSCFG_VTOR_NSEC) == SYSCFG_VTOR_NSEC)|| \
                                        (((SELECT) & SYSCFG_VTOR_AIRCR_SEC) == SYSCFG_VTOR_AIRCR_SEC))
/**
  * @}
  */

/** @defgroup SYSCFG_FPU_Interrupts SYSCFG FPU Interrupts
  * @{
  */
#define SYSCFG_IT_FPU_IDC              SYSCFG_M33SSCR_FPU_IT_EN_5 /*!< Floating Point Unit Input denormal Interrupt */
#define SYSCFG_IT_FPU_IXC              SYSCFG_M33SSCR_FPU_IT_EN_4 /*!< Floating Point Unit Inexact Interrupt */
#define SYSCFG_IT_FPU_UFC              SYSCFG_M33SSCR_FPU_IT_EN_3 /*!< Floating Point Unit Underflow Interrupt */
#define SYSCFG_IT_FPU_OFC              SYSCFG_M33SSCR_FPU_IT_EN_2 /*!< Floating Point Unit Overflow Interrupt */
#define SYSCFG_IT_FPU_DZC              SYSCFG_M33SSCR_FPU_IT_EN_1 /*!< Floating Point Unit Divide-by-zero Interrupt */
#define SYSCFG_IT_FPU_IOC              SYSCFG_M33SSCR_FPU_IT_EN_0 /*!< Floating Point Unit Invalid operation Interrupt */

#define IS_SYSCFG_FPU_INTERRUPT(__INTERRUPT__) ((((__INTERRUPT__) & SYSCFG_IT_FPU_IOC) == SYSCFG_IT_FPU_IOC) || \
                                                (((__INTERRUPT__) & SYSCFG_IT_FPU_DZC) == SYSCFG_IT_FPU_DZC) || \
                                                (((__INTERRUPT__) & SYSCFG_IT_FPU_UFC) == SYSCFG_IT_FPU_UFC) || \
                                                (((__INTERRUPT__) & SYSCFG_IT_FPU_OFC) == SYSCFG_IT_FPU_OFC) || \
                                                (((__INTERRUPT__) & SYSCFG_IT_FPU_IDC) == SYSCFG_IT_FPU_IDC) || \
                                                (((__INTERRUPT__) & SYSCFG_IT_FPU_IXC) == SYSCFG_IT_FPU_IXC))
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup HAL_Exported_Macros HAL Exported Macros
  * @{
  */

/** @defgroup DBG_Exported_Macros DBGMCU Exported Macros
   * @{
   */

/** @brief  Freeze and Unfreeze Peripherals in Debug mode
   */

#if defined (CORE_CA35)
#if defined(DBGMCU_AHB2LFZ_DBG_HPDMA1_CH0_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA1_CH0()     SET_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH0_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA1_CH0()   CLEAR_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH0_STOP)
#endif /*DBGMCU_AHB2LFZ_DBG_HPDMA1_CH0_STOP*/

#if defined(DBGMCU_AHB2LFZ_DBG_HPDMA1_CH1_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA1_CH1()     SET_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH1_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA1_CH1()   CLEAR_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH1_STOP)
#endif /*DBGMCU_AHB2LFZ_DBG_HPDMA1_CH1_STOP*/

