zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal.h
#if defined(DBGMCU_AHB2LFZ_DBG_HPDMA1_CH2_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA1_CH2()     SET_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH2_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA1_CH2()   CLEAR_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH2_STOP)
#endif /*DBGMCU_AHB2LFZ_DBG_HPDMA1_CH2_STOP*/

#if defined(DBGMCU_AHB2LFZ_DBG_HPDMA1_CH3_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA1_CH3()     SET_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH3_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA1_CH3()   CLEAR_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH3_STOP)
#endif /*DBGMCU_AHB2LFZ_DBG_HPDMA1_CH3_STOP*/

#if defined(DBGMCU_AHB2LFZ_DBG_HPDMA1_CH4_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA1_CH4()     SET_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH4_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA1_CH4()   CLEAR_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH4_STOP)
#endif /*DBGMCU_AHB2LFZ_DBG_HPDMA1_CH4_STOP*/

#if defined(DBGMCU_AHB2LFZ_DBG_HPDMA1_CH5_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA1_CH5()     SET_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH5_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA1_CH5()   CLEAR_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH5_STOP)
#endif /*DBGMCU_AHB2LFZ_DBG_HPDMA1_CH5_STOP*/

#if defined(DBGMCU_AHB2LFZ_DBG_HPDMA1_CH6_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA1_CH6()     SET_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH6_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA1_CH6()   CLEAR_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH6_STOP)
#endif /*DBGMCU_AHB2LFZ_DBG_HPDMA1_CH6_STOP*/

#if defined(DBGMCU_AHB2LFZ_DBG_HPDMA1_CH7_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA1_CH7()     SET_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH7_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA1_CH7()   CLEAR_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH7_STOP)
#endif /*DBGMCU_AHB2LFZ_DBG_HPDMA1_CH7_STOP*/

#if defined(DBGMCU_AHB2LFZ_DBG_HPDMA1_CH8_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA1_CH8()     SET_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH8_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA1_CH8()   CLEAR_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH8_STOP)
#endif /*DBGMCU_AHB2LFZ_DBG_HPDMA1_CH8_STOP*/

#if defined(DBGMCU_AHB2LFZ_DBG_HPDMA1_CH9_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA1_CH9()     SET_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH9_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA1_CH9()   CLEAR_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH9_STOP)
#endif /*DBGMCU_AHB2LFZ_DBG_HPDMA1_CH9_STOP*/

#if defined(DBGMCU_AHB2LFZ_DBG_HPDMA1_CH10_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA1_CH10()    SET_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH10_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA1_CH10()  CLEAR_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH10_STOP)
#endif /*DBGMCU_AHB2LFZ_DBG_HPDMA1_CH10_STOP*/

#if defined(DBGMCU_AHB2LFZ_DBG_HPDMA1_CH11_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA1_CH11()    SET_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH11_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA1_CH11()  CLEAR_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH11_STOP)
#endif /*DBGMCU_AHB2LFZ_DBG_HPDMA1_CH11_STOP*/

#if defined(DBGMCU_AHB2LFZ_DBG_HPDMA1_CH12_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA1_CH12()    SET_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH12_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA1_CH12()  CLEAR_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH12_STOP)
#endif /*DBGMCU_AHB2LFZ_DBG_HPDMA1_CH12_STOP*/

#if defined(DBGMCU_AHB2LFZ_DBG_HPDMA1_CH13_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA1_CH13()    SET_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH13_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA1_CH13()  CLEAR_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH13_STOP)
#endif /*DBGMCU_AHB2LFZ_DBG_HPDMA1_CH13_STOP*/

#if defined(DBGMCU_AHB2LFZ_DBG_HPDMA1_CH14_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA1_CH14()    SET_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH14_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA1_CH14()  CLEAR_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH14_STOP)
#endif /*DBGMCU_AHB2LFZ_DBG_HPDMA1_CH14_STOP*/

#if defined(DBGMCU_AHB2LFZ_DBG_HPDMA1_CH15_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA1_CH15()    SET_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH15_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA1_CH15()  CLEAR_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH15_STOP)
#endif /*DBGMCU_AHB2LFZ_DBG_HPDMA1_CH15_STOP*/

#if defined(DBGMCU_AHB2LFZ_DBG_HPDMA2_CH0_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA2_CH0()     SET_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA2_CH0_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA2_CH0()   CLEAR_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA2_CH0_STOP)
#endif /*DBGMCU_AHB2LFZ_DBG_HPDMA2_CH0_STOP*/

#if defined(DBGMCU_AHB2LFZ_DBG_HPDMA2_CH1_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA2_CH1()     SET_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA2_CH1_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA2_CH1()   CLEAR_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA2_CH1_STOP)
#endif /*DBGMCU_AHB2LFZ_DBG_HPDMA2_CH1_STOP*/

#if defined(DBGMCU_AHB2LFZ_DBG_HPDMA2_CH2_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA2_CH2()     SET_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA2_CH2_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA2_CH2()   CLEAR_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA2_CH2_STOP)
#endif /*DBGMCU_AHB2LFZ_DBG_HPDMA2_CH2_STOP*/

#if defined(DBGMCU_AHB2LFZ_DBG_HPDMA2_CH3_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA2_CH3()     SET_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA2_CH3_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA2_CH3()   CLEAR_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA2_CH3_STOP)
#endif /*DBGMCU_AHB2LFZ_DBG_HPDMA2_CH3_STOP*/

#if defined(DBGMCU_AHB2LFZ_DBG_HPDMA2_CH4_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA2_CH4()     SET_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA2_CH4_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA2_CH4()   CLEAR_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA2_CH4_STOP)
#endif /*DBGMCU_AHB2LFZ_DBG_HPDMA2_CH4_STOP*/

#if defined(DBGMCU_AHB2LFZ_DBG_HPDMA2_CH5_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA2_CH5()     SET_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA2_CH5_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA2_CH5()   CLEAR_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA2_CH5_STOP)
#endif /*DBGMCU_AHB2LFZ_DBG_HPDMA2_CH5_STOP*/

#if defined(DBGMCU_AHB2LFZ_DBG_HPDMA2_CH6_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA2_CH6()     SET_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA2_CH6_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA2_CH6()   CLEAR_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA2_CH6_STOP)
#endif /*DBGMCU_AHB2LFZ_DBG_HPDMA2_CH6_STOP*/

#if defined(DBGMCU_AHB2LFZ_DBG_HPDMA2_CH7_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA2_CH7()     SET_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA2_CH7_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA2_CH7()   CLEAR_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA2_CH7_STOP)
#endif /*DBGMCU_AHB2LFZ_DBG_HPDMA2_CH7_STOP*/

#if defined(DBGMCU_AHB2LFZ_DBG_HPDMA2_CH8_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA2_CH8()     SET_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA2_CH8_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA2_CH8()   CLEAR_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA2_CH8_STOP)
#endif /*DBGMCU_AHB2LFZ_DBG_HPDMA2_CH8_STOP*/

#if defined(DBGMCU_AHB2LFZ_DBG_HPDMA2_CH9_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA2_CH9()     SET_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA2_CH9_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA2_CH9()   CLEAR_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA2_CH9_STOP)
#endif /*DBGMCU_AHB2LFZ_DBG_HPDMA2_CH9_STOP*/

#if defined(DBGMCU_AHB2LFZ_DBG_HPDMA2_CH10_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA2_CH10()    SET_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA2_CH10_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA2_CH10()  CLEAR_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA2_CH10_STOP)
#endif /*DBGMCU_AHB2LFZ_DBG_HPDMA2_CH10_STOP*/

#if defined(DBGMCU_AHB2LFZ_DBG_HPDMA2_CH11_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA2_CH11()    SET_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA2_CH11_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA2_CH11()  CLEAR_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA2_CH11_STOP)
#endif /*DBGMCU_AHB2LFZ_DBG_HPDMA2_CH11_STOP*/

