zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal.h
#if defined(DBGMCU_AHB2LFZ_DBG_HPDMA2_CH12_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA2_CH12()    SET_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA2_CH12_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA2_CH12()  CLEAR_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA2_CH12_STOP)
#endif /*DBGMCU_AHB2LFZ_DBG_HPDMA2_CH12_STOP*/

#if defined(DBGMCU_AHB2LFZ_DBG_HPDMA2_CH13_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA2_CH13()    SET_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA2_CH13_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA2_CH13()  CLEAR_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA2_CH13_STOP)
#endif /*DBGMCU_AHB2LFZ_DBG_HPDMA2_CH13_STOP*/

#if defined(DBGMCU_AHB2LFZ_DBG_HPDMA2_CH14_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA2_CH14()    SET_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA2_CH14_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA2_CH14()  CLEAR_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA2_CH14_STOP)
#endif /*DBGMCU_AHB2LFZ_DBG_HPDMA2_CH14_STOP*/

#if defined(DBGMCU_AHB2LFZ_DBG_HPDMA2_CH15_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA2_CH15()    SET_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA2_CH15_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA2_CH15()  CLEAR_BIT(DBGMCU->AHB2LFZ1, DBGMCU_AHB2LFZ_DBG_HPDMA2_CH15_STOP)
#endif /*DBGMCU_AHB2LFZ_DBG_HPDMA2_CH15_STOP*/

#if defined(DBGMCU_AHB2HFZ_DBG_HPDMA3_CH0_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA3_CH0()     SET_BIT(DBGMCU->AHB2HFZ1, DBGMCU_AHB2HFZ_DBG_HPDMA3_CH0_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA3_CH0()   CLEAR_BIT(DBGMCU->AHB2HFZ1, DBGMCU_AHB2HFZ_DBG_HPDMA3_CH0_STOP)
#endif /*DBGMCU_AHB2HFZ_DBG_HPDMA3_CH0_STOP*/

#if defined(DBGMCU_AHB2HFZ_DBG_HPDMA3_CH1_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA3_CH1()     SET_BIT(DBGMCU->AHB2HFZ1, DBGMCU_AHB2HFZ_DBG_HPDMA3_CH1_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA3_CH1()   CLEAR_BIT(DBGMCU->AHB2HFZ1, DBGMCU_AHB2HFZ_DBG_HPDMA3_CH1_STOP)
#endif /*DBGMCU_AHB2HFZ_DBG_HPDMA3_CH1_STOP*/

#if defined(DBGMCU_AHB2HFZ_DBG_HPDMA3_CH2_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA3_CH2()     SET_BIT(DBGMCU->AHB2HFZ1, DBGMCU_AHB2HFZ_DBG_HPDMA3_CH2_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA3_CH2()   CLEAR_BIT(DBGMCU->AHB2HFZ1, DBGMCU_AHB2HFZ_DBG_HPDMA3_CH2_STOP)
#endif /*DBGMCU_AHB2HFZ_DBG_HPDMA3_CH2_STOP*/

#if defined(DBGMCU_AHB2HFZ_DBG_HPDMA3_CH3_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA3_CH3()     SET_BIT(DBGMCU->AHB2HFZ1, DBGMCU_AHB2HFZ_DBG_HPDMA3_CH3_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA3_CH3()   CLEAR_BIT(DBGMCU->AHB2HFZ1, DBGMCU_AHB2HFZ_DBG_HPDMA3_CH3_STOP)
#endif /*DBGMCU_AHB2HFZ_DBG_HPDMA3_CH3_STOP*/

#if defined(DBGMCU_AHB2HFZ_DBG_HPDMA3_CH4_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA3_CH4()     SET_BIT(DBGMCU->AHB2HFZ1, DBGMCU_AHB2HFZ_DBG_HPDMA3_CH4_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA3_CH4()   CLEAR_BIT(DBGMCU->AHB2HFZ1, DBGMCU_AHB2HFZ_DBG_HPDMA3_CH4_STOP)
#endif /*DBGMCU_AHB2HFZ_DBG_HPDMA3_CH4_STOP*/

#if defined(DBGMCU_AHB2HFZ_DBG_HPDMA3_CH5_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA3_CH5()     SET_BIT(DBGMCU->AHB2HFZ1, DBGMCU_AHB2HFZ_DBG_HPDMA3_CH5_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA3_CH5()   CLEAR_BIT(DBGMCU->AHB2HFZ1, DBGMCU_AHB2HFZ_DBG_HPDMA3_CH5_STOP)
#endif /*DBGMCU_AHB2HFZ_DBG_HPDMA3_CH5_STOP*/

#if defined(DBGMCU_AHB2HFZ_DBG_HPDMA3_CH6_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA3_CH6()     SET_BIT(DBGMCU->AHB2HFZ1, DBGMCU_AHB2HFZ_DBG_HPDMA3_CH6_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA3_CH6()   CLEAR_BIT(DBGMCU->AHB2HFZ1, DBGMCU_AHB2HFZ_DBG_HPDMA3_CH6_STOP)
#endif /*DBGMCU_AHB2HFZ_DBG_HPDMA3_CH6_STOP*/

#if defined(DBGMCU_AHB2HFZ_DBG_HPDMA3_CH7_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA3_CH7()     SET_BIT(DBGMCU->AHB2HFZ1, DBGMCU_AHB2HFZ_DBG_HPDMA3_CH7_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA3_CH7()   CLEAR_BIT(DBGMCU->AHB2HFZ1, DBGMCU_AHB2HFZ_DBG_HPDMA3_CH7_STOP)
#endif /*DBGMCU_AHB2HFZ_DBG_HPDMA3_CH7_STOP*/

#if defined(DBGMCU_AHB2HFZ_DBG_HPDMA3_CH8_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA3_CH8()     SET_BIT(DBGMCU->AHB2HFZ1, DBGMCU_AHB2HFZ_DBG_HPDMA3_CH8_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA3_CH8()   CLEAR_BIT(DBGMCU->AHB2HFZ1, DBGMCU_AHB2HFZ_DBG_HPDMA3_CH8_STOP)
#endif /*DBGMCU_AHB2HFZ_DBG_HPDMA3_CH8_STOP*/

#if defined(DBGMCU_AHB2HFZ_DBG_HPDMA3_CH9_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA3_CH9()     SET_BIT(DBGMCU->AHB2HFZ1, DBGMCU_AHB2HFZ_DBG_HPDMA3_CH9_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA3_CH9()   CLEAR_BIT(DBGMCU->AHB2HFZ1, DBGMCU_AHB2HFZ_DBG_HPDMA3_CH9_STOP)
#endif /*DBGMCU_AHB2HFZ_DBG_HPDMA3_CH9_STOP*/

#if defined(DBGMCU_AHB2HFZ_DBG_HPDMA3_CH10_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA3_CH10()    SET_BIT(DBGMCU->AHB2HFZ1, DBGMCU_AHB2HFZ_DBG_HPDMA3_CH10_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA3_CH10()  CLEAR_BIT(DBGMCU->AHB2HFZ1, DBGMCU_AHB2HFZ_DBG_HPDMA3_CH10_STOP)
#endif /*DBGMCU_AHB2HFZ_DBG_HPDMA3_CH10_STOP*/

#if defined(DBGMCU_AHB2HFZ_DBG_HPDMA3_CH11_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA3_CH11()    SET_BIT(DBGMCU->AHB2HFZ1, DBGMCU_AHB2HFZ_DBG_HPDMA3_CH11_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA3_CH11()  CLEAR_BIT(DBGMCU->AHB2HFZ1, DBGMCU_AHB2HFZ_DBG_HPDMA3_CH11_STOP)
#endif /*DBGMCU_AHB2HFZ_DBG_HPDMA3_CH11_STOP*/

#if defined(DBGMCU_AHB2HFZ_DBG_HPDMA3_CH12_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA3_CH12()    SET_BIT(DBGMCU->AHB2HFZ1, DBGMCU_AHB2HFZ_DBG_HPDMA3_CH12_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA3_CH12()  CLEAR_BIT(DBGMCU->AHB2HFZ1, DBGMCU_AHB2HFZ_DBG_HPDMA3_CH12_STOP)
#endif /*DBGMCU_AHB2HFZ_DBG_HPDMA3_CH12_STOP*/

#if defined(DBGMCU_AHB2HFZ_DBG_HPDMA3_CH13_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA3_CH13()    SET_BIT(DBGMCU->AHB2HFZ1, DBGMCU_AHB2HFZ_DBG_HPDMA3_CH13_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA3_CH13()  CLEAR_BIT(DBGMCU->AHB2HFZ1, DBGMCU_AHB2HFZ_DBG_HPDMA3_CH13_STOP)
#endif /*DBGMCU_AHB2HFZ_DBG_HPDMA3_CH13_STOP*/

#if defined(DBGMCU_AHB2HFZ_DBG_HPDMA3_CH14_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA3_CH14()    SET_BIT(DBGMCU->AHB2HFZ1, DBGMCU_AHB2HFZ_DBG_HPDMA3_CH14_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA3_CH14()  CLEAR_BIT(DBGMCU->AHB2HFZ1, DBGMCU_AHB2HFZ_DBG_HPDMA3_CH14_STOP)
#endif /*DBGMCU_AHB2HFZ_DBG_HPDMA3_CH14_STOP*/

#if defined(DBGMCU_AHB2HFZ_DBG_HPDMA3_CH15_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA3_CH15()    SET_BIT(DBGMCU->AHB2HFZ1, DBGMCU_AHB2HFZ_DBG_HPDMA3_CH15_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA3_CH15()  CLEAR_BIT(DBGMCU->AHB2HFZ1, DBGMCU_AHB2HFZ_DBG_HPDMA3_CH15_STOP)
#endif /*DBGMCU_AHB2HFZ_DBG_HPDMA3_CH15_STOP*/

#if defined(DBGMCU_AHBSRFZ_DBG_LPDMA_CH0_STOP)
#define __HAL_DBGMCU_FREEZE_LPDMA_CH0()      SET_BIT(DBGMCU->AHBSRFZ1, DBGMCU_AHBSRFZ_DBG_LPDMA_CH0_STOP)
#define __HAL_DBGMCU_UNFREEZE_LPDMA_CH0()    CLEAR_BIT(DBGMCU->AHBSRFZ1, DBGMCU_AHBSRFZ_DBG_LPDMA_CH0_STOP)
#endif /*DBGMCU_AHBSRFZ_DBG_LPDMA_CH0_STOP*/

#if defined(DBGMCU_AHBSRFZ_DBG_LPDMA_CH1_STOP)
#define __HAL_DBGMCU_FREEZE_LPDMA_CH1()      SET_BIT(DBGMCU->AHBSRFZ1, DBGMCU_AHBSRFZ_DBG_LPDMA_CH1_STOP)
#define __HAL_DBGMCU_UNFREEZE_LPDMA_CH1()    CLEAR_BIT(DBGMCU->AHBSRFZ1, DBGMCU_AHBSRFZ_DBG_LPDMA_CH1_STOP)
#endif /*DBGMCU_AHBSRFZ_DBG_LPDMA_CH1_STOP*/

#if defined(DBGMCU_AHBSRFZ_DBG_LPDMA_CH2_STOP)
#define __HAL_DBGMCU_FREEZE_LPDMA_CH2()      SET_BIT(DBGMCU->AHBSRFZ1, DBGMCU_AHBSRFZ_DBG_LPDMA_CH2_STOP)
#define __HAL_DBGMCU_UNFREEZE_LPDMA_CH2()    CLEAR_BIT(DBGMCU->AHBSRFZ1, DBGMCU_AHBSRFZ_DBG_LPDMA_CH2_STOP)
#endif /*DBGMCU_AHBSRFZ_DBG_LPDMA_CH2_STOP*/

#if defined(DBGMCU_AHBSRFZ_DBG_LPDMA_CH3_STOP)
#define __HAL_DBGMCU_FREEZE_LPDMA_CH3()      SET_BIT(DBGMCU->AHBSRFZ1, DBGMCU_AHBSRFZ_DBG_LPDMA_CH3_STOP)
#define __HAL_DBGMCU_UNFREEZE_LPDMA_CH3()    CLEAR_BIT(DBGMCU->AHBSRFZ1, DBGMCU_AHBSRFZ_DBG_LPDMA_CH3_STOP)
#endif /*DBGMCU_AHBSRFZ_DBG_LPDMA_CH3_STOP*/

#if defined(DBGMCU_APB1FZ_DBG_TIM2_STOP)
#define __HAL_DBGMCU_FREEZE_TIM2()           SET_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_TIM2_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM2()         CLEAR_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_TIM2_STOP)
#endif /*DBGMCU_APB1FZ_DBG_TIM2_STOP*/

#if defined(DBGMCU_APB1FZ_DBG_TIM3_STOP)
#define __HAL_DBGMCU_FREEZE_TIM3()           SET_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_TIM3_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM3()         CLEAR_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_TIM3_STOP)
#endif /*DBGMCU_APB1FZ_DBG_TIM3_STOP*/

