zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal.h
#if defined(DBGMCU_APB1FZ_DBG_TIM4_STOP)
#define __HAL_DBGMCU_FREEZE_TIM4()           SET_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_TIM4_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM4()         CLEAR_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_TIM4_STOP)
#endif /*DBGMCU_APB1FZ_DBG_TIM4_STOP*/

#if defined(DBGMCU_APB1FZ_DBG_TIM5_STOP)
#define __HAL_DBGMCU_FREEZE_TIM5()           SET_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_TIM5_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM5()         CLEAR_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_TIM5_STOP)
#endif /*DBGMCU_APB1FZ_DBG_TIM5_STOP*/

#if defined(DBGMCU_APB1FZ_DBG_TIM6_STOP)
#define __HAL_DBGMCU_FREEZE_TIM6()           SET_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_TIM6_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM6()         CLEAR_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_TIM6_STOP)
#endif /*DBGMCU_APB1FZ_DBG_TIM6_STOP*/

#if defined(DBGMCU_APB1FZ_DBG_TIM7_STOP)
#define __HAL_DBGMCU_FREEZE_TIM7()           SET_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_TIM7_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM7()         CLEAR_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_TIM7_STOP)
#endif /*DBGMCU_APB1FZ_DBG_TIM7_STOP*/

#if defined(DBGMCU_APB1FZ_DBG_TIM10_STOP)
#define __HAL_DBGMCU_FREEZE_TIM10()          SET_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_TIM10_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM10()        CLEAR_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_TIM10_STOP)
#endif /*DBGMCU_APB1FZ_DBG_TIM10_STOP*/

#if defined(DBGMCU_APB1FZ_DBG_TIM11_STOP)
#define __HAL_DBGMCU_FREEZE_TIM11()          SET_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_TIM11_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM11()        CLEAR_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_TIM11_STOP)
#endif /*DBGMCU_APB1FZ_DBG_TIM11_STOP*/

#if defined(DBGMCU_APB1FZ_DBG_TIM12_STOP)
#define __HAL_DBGMCU_FREEZE_TIM12()          SET_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_TIM12_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM12()        CLEAR_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_TIM12_STOP)
#endif /*DBGMCU_APB1FZ_DBG_TIM12_STOP*/

#if defined(DBGMCU_APB1FZ_DBG_TIM13_STOP)
#define __HAL_DBGMCU_FREEZE_TIM13()          SET_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_TIM13_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM13()        CLEAR_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_TIM13_STOP)
#endif /*DBGMCU_APB1FZ_DBG_TIM13_STOP*/

#if defined(DBGMCU_APB1FZ_DBG_TIM14_STOP)
#define __HAL_DBGMCU_FREEZE_TIM14()          SET_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_TIM14_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM14()        CLEAR_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_TIM14_STOP)
#endif /*DBGMCU_APB1FZ_DBG_TIM14_STOP*/

#if defined(DBGMCU_APB1FZ_DBG_LPTIM1_STOP)
#define __HAL_DBGMCU_FREEZE_LPTIM1()         SET_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_LPTIM1_STOP)
#define __HAL_DBGMCU_UNFREEZE_LPTIM1()       CLEAR_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_LPTIM1_STOP)
#endif /*DBGMCU_APB1FZ_DBG_LPTIM1_STOP*/

#if defined(DBGMCU_APB1FZ_DBG_LPTIM2_STOP)
#define __HAL_DBGMCU_FREEZE_LPTIM2()         SET_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_LPTIM2_STOP)
#define __HAL_DBGMCU_UNFREEZE_LPTIM2()       CLEAR_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_LPTIM2_STOP)
#endif /*DBGMCU_APB1FZ_DBG_LPTIM2_STOP*/

#if defined(DBGMCU_APB1FZ_DBG_I2C1_STOP)
#define __HAL_DBGMCU_FREEZE_I2C1()           SET_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_I2C1_STOP)
#define __HAL_DBGMCU_UNFREEZE_I2C1()         CLEAR_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_I2C1_STOP)
#endif /*DBGMCU_APB1FZ_DBG_I2C1_STOP*/

#if defined(DBGMCU_APB1FZ_DBG_I2C2_STOP)
#define __HAL_DBGMCU_FREEZE_I2C2()           SET_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_I2C2_STOP)
#define __HAL_DBGMCU_UNFREEZE_I2C2()         CLEAR_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_I2C2_STOP)
#endif /*DBGMCU_APB1FZ_DBG_I2C2_STOP*/

#if defined(DBGMCU_APB1FZ_DBG_I2C3_STOP)
#define __HAL_DBGMCU_FREEZE_I2C3()           SET_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_I2C3_STOP)
#define __HAL_DBGMCU_UNFREEZE_I2C3()         CLEAR_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_I2C3_STOP)
#endif /*DBGMCU_APB1FZ_DBG_I2C3_STOP*/

#if defined(DBGMCU_APB1FZ_DBG_I2C4_STOP)
#define __HAL_DBGMCU_FREEZE_I2C4()           SET_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_I2C4_STOP)
#define __HAL_DBGMCU_UNFREEZE_I2C4()         CLEAR_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_I2C4_STOP)
#endif /*DBGMCU_APB1FZ_DBG_I2C4_STOP*/

#if defined(DBGMCU_APB1FZ_DBG_I2C5_STOP)
#define __HAL_DBGMCU_FREEZE_I2C5()           SET_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_I2C5_STOP)
#define __HAL_DBGMCU_UNFREEZE_I2C5()         CLEAR_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_I2C5_STOP)
#endif /*DBGMCU_APB1FZ_DBG_I2C5_STOP*/

#if defined(DBGMCU_APB1FZ_DBG_I2C6_STOP)
#define __HAL_DBGMCU_FREEZE_I2C6()           SET_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_I2C6_STOP)
#define __HAL_DBGMCU_UNFREEZE_I2C6()         CLEAR_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_I2C6_STOP)
#endif /*DBGMCU_APB1FZ_DBG_I2C6_STOP*/

#if defined(DBGMCU_APB1FZ_DBG_I2C7_STOP)
#define __HAL_DBGMCU_FREEZE_I2C7()           SET_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_I2C7_STOP)
#define __HAL_DBGMCU_UNFREEZE_I2C7()         CLEAR_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_I2C7_STOP)
#endif /*DBGMCU_APB1FZ_DBG_I2C7_STOP*/

#if defined(DBGMCU_APB1FZ_DBG_I3C1_STOP)
#define __HAL_DBGMCU_FREEZE_I3C1()           SET_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_I3C1_STOP)
#define __HAL_DBGMCU_UNFREEZE_I3C1()         CLEAR_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_I3C1_STOP)
#endif /*DBGMCU_APB1FZ_DBG_I3C1_STOP*/

#if defined(DBGMCU_APB1FZ_DBG_I3C2_STOP)
#define __HAL_DBGMCU_FREEZE_I3C2()           SET_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_I3C2_STOP)
#define __HAL_DBGMCU_UNFREEZE_I3C2()         CLEAR_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_I3C2_STOP)
#endif /*DBGMCU_APB1FZ_DBG_I3C2_STOP*/

#if defined(DBGMCU_APB1FZ_DBG_I3C3_STOP)
#define __HAL_DBGMCU_FREEZE_I3C3()           SET_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_I3C3_STOP)
#define __HAL_DBGMCU_UNFREEZE_I3C3()         CLEAR_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1FZ_DBG_I3C3_STOP)
#endif /*DBGMCU_APB1FZ_DBG_I3C3_STOP*/

#if defined(DBGMCU_APB2FZ_DBG_TIM1_STOP)
#define __HAL_DBGMCU_FREEZE_TIM1()           SET_BIT(DBGMCU->APB2FZ1, DBGMCU_APB2FZ_DBG_TIM1_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM1()         CLEAR_BIT(DBGMCU->APB2FZ1, DBGMCU_APB2FZ_DBG_TIM1_STOP)
#endif /*DBGMCU_APB2FZ_DBG_TIM1_STOP*/

#if defined(DBGMCU_APB2FZ_DBG_TIM8_STOP)
#define __HAL_DBGMCU_FREEZE_TIM8()           SET_BIT(DBGMCU->APB2FZ1, DBGMCU_APB2FZ_DBG_TIM8_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM8()         CLEAR_BIT(DBGMCU->APB2FZ1, DBGMCU_APB2FZ_DBG_TIM8_STOP)
#endif /*DBGMCU_APB2FZ_DBG_TIM8_STOP*/

#if defined(DBGMCU_APB2FZ_DBG_TIM15_STOP)
#define __HAL_DBGMCU_FREEZE_TIM15()          SET_BIT(DBGMCU->APB2FZ1, DBGMCU_APB2FZ_DBG_TIM15_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM15()        CLEAR_BIT(DBGMCU->APB2FZ1, DBGMCU_APB2FZ_DBG_TIM15_STOP)
#endif /*DBGMCU_APB2FZ_DBG_TIM15_STOP*/

#if defined(DBGMCU_APB2FZ_DBG_TIM16_STOP)
#define __HAL_DBGMCU_FREEZE_TIM16()          SET_BIT(DBGMCU->APB2FZ1, DBGMCU_APB2FZ_DBG_TIM16_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM16()        CLEAR_BIT(DBGMCU->APB2FZ1, DBGMCU_APB2FZ_DBG_TIM16_STOP)
#endif /*DBGMCU_APB2FZ_DBG_TIM16_STOP*/

#if defined(DBGMCU_APB2FZ_DBG_TIM17_STOP)
#define __HAL_DBGMCU_FREEZE_TIM17()          SET_BIT(DBGMCU->APB2FZ1, DBGMCU_APB2FZ_DBG_TIM17_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM17()        CLEAR_BIT(DBGMCU->APB2FZ1, DBGMCU_APB2FZ_DBG_TIM17_STOP)
#endif /*DBGMCU_APB2FZ_DBG_TIM17_STOP*/

#if defined(DBGMCU_APB2FZ_DBG_TIM20_STOP)
#define __HAL_DBGMCU_FREEZE_TIM20()          SET_BIT(DBGMCU->APB2FZ1, DBGMCU_APB2FZ_DBG_TIM20_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM20()        CLEAR_BIT(DBGMCU->APB2FZ1, DBGMCU_APB2FZ_DBG_TIM20_STOP)
#endif /*DBGMCU_APB2FZ_DBG_TIM20_STOP*/

#if defined(DBGMCU_APB2FZ_DBG_FDCAN_STOP)
#define __HAL_DBGMCU_FREEZE_FDCAN()          SET_BIT(DBGMCU->APB2FZ1, DBGMCU_APB2FZ_DBG_FDCAN_STOP)
#define __HAL_DBGMCU_UNFREEZE_FDCAN()        CLEAR_BIT(DBGMCU->APB2FZ1, DBGMCU_APB2FZ_DBG_FDCAN_STOP)
#endif /*DBGMCU_APB2FZ_DBG_FDCAN_STOP*/

#if defined(DBGMCU_APB3FZ_DBG_IWDG1_STOP)
#define __HAL_DBGMCU_FREEZE_IWDG1()          SET_BIT(DBGMCU->APB3FZ1, DBGMCU_APB3FZ_DBG_IWDG1_STOP)
#define __HAL_DBGMCU_UNFREEZE_IWDG1()        CLEAR_BIT(DBGMCU->APB3FZ1, DBGMCU_APB3FZ_DBG_IWDG1_STOP)
#endif /*DBGMCU_APB3FZ_DBG_IWDG1_STOP*/

#if defined(DBGMCU_APB3FZ_DBG_IWDG2_STOP)
#define __HAL_DBGMCU_FREEZE_IWDG2()          SET_BIT(DBGMCU->APB3FZ1, DBGMCU_APB3FZ_DBG_IWDG2_STOP)
#define __HAL_DBGMCU_UNFREEZE_IWDG2()        CLEAR_BIT(DBGMCU->APB3FZ1, DBGMCU_APB3FZ_DBG_IWDG2_STOP)
#endif /*DBGMCU_APB3FZ_DBG_IWDG2_STOP*/

#if defined(DBGMCU_APB3FZ_DBG_WWDG1_STOP)
#define __HAL_DBGMCU_FREEZE_WWDG1()          SET_BIT(DBGMCU->APB3FZ1, DBGMCU_APB3FZ_DBG_WWDG1_STOP)
#define __HAL_DBGMCU_UNFREEZE_WWDG1()        CLEAR_BIT(DBGMCU->APB3FZ1, DBGMCU_APB3FZ_DBG_WWDG1_STOP)
#endif /*DBGMCU_APB3FZ_DBG_WWDG1_STOP*/

