zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal.h
#if defined(DBGMCU_APBSRFZ_DBG_RTC_STOP)
#define __HAL_DBGMCU_FREEZE_RTC()           SET_BIT(DBGMCU->APBSRFZ1, DBGMCU_APBSRFZ_DBG_RTC_STOP)
#define __HAL_DBGMCU_UNFREEZE_RTC()         CLEAR_BIT(DBGMCU->APBSRFZ1, DBGMCU_APBSRFZ_DBG_RTC_STOP)
#endif /*DBGMCU_APBSRFZ_DBG_RTC_STOP*/

#if defined(DBGMCU_APBSRFZ_DBG_I2C8_STOP)
#define __HAL_DBGMCU_FREEZE_I2C8()           SET_BIT(DBGMCU->APBSRFZ1, DBGMCU_APBSRFZ_DBG_I2C8_STOP)
#define __HAL_DBGMCU_UNFREEZE_I2C8()         CLEAR_BIT(DBGMCU->APBSRFZ1, DBGMCU_APBSRFZ_DBG_I2C8_STOP)
#endif /*DBGMCU_APBSRFZ_DBG_I2C8_STOP*/

#if defined(DBGMCU_APBSRFZ_DBG_I3C4_STOP)
#define __HAL_DBGMCU_FREEZE_I3C4()           SET_BIT(DBGMCU->APBSRFZ1, DBGMCU_APBSRFZ_DBG_I3C4_STOP)
#define __HAL_DBGMCU_UNFREEZE_I3C4()         CLEAR_BIT(DBGMCU->APBSRFZ1, DBGMCU_APBSRFZ_DBG_I3C4_STOP)
#endif /*DBGMCU_APBSRFZ_DBG_I3C4_STOP*/

#if defined(DBGMCU_APBSRFZ_DBG_LPTIM3_STOP)
#define __HAL_DBGMCU_FREEZE_LPTIM3()         SET_BIT(DBGMCU->APBSRFZ1, DBGMCU_APBSRFZ_DBG_LPTIM3_STOP)
#define __HAL_DBGMCU_UNFREEZE_LPTIM3()       CLEAR_BIT(DBGMCU->APBSRFZ1, DBGMCU_APBSRFZ_DBG_LPTIM3_STOP)
#endif /*DBGMCU_APBSRFZ_DBG_LPTIM3_STOP*/

#if defined(DBGMCU_APBSRFZ_DBG_LPTIM4_STOP)
#define __HAL_DBGMCU_FREEZE_LPTIM4()         SET_BIT(DBGMCU->APBSRFZ1, DBGMCU_APBSRFZ_DBG_LPTIM4_STOP)
#define __HAL_DBGMCU_UNFREEZE_LPTIM4()       CLEAR_BIT(DBGMCU->APBSRFZ1, DBGMCU_APBSRFZ_DBG_LPTIM4_STOP)
#endif /*DBGMCU_APBSRFZ_DBG_LPTIM4_STOP*/

#if defined(DBGMCU_APBSRFZ_DBG_LPTIM5_STOP)
#define __HAL_DBGMCU_FREEZE_LPTIM5()         SET_BIT(DBGMCU->APBSRFZ1, DBGMCU_APBSRFZ_DBG_LPTIM5_STOP)
#define __HAL_DBGMCU_UNFREEZE_LPTIM5()       CLEAR_BIT(DBGMCU->APBSRFZ1, DBGMCU_APBSRFZ_DBG_LPTIM5_STOP)
#endif /*DBGMCU_APBSRFZ_DBG_LPTIM5_STOP*/

#if defined(DBGMCU_APBSRFZ_DBG_WWDG2_STOP)
#define __HAL_DBGMCU_FREEZE_WWDG2()          SET_BIT(DBGMCU->APBSRFZ1, DBGMCU_APBSRFZ_DBG_WWDG2_STOP)
#define __HAL_DBGMCU_UNFREEZE_WWDG2()        CLEAR_BIT(DBGMCU->APBSRFZ1, DBGMCU_APBSRFZ_DBG_WWDG2_STOP)
#endif /*DBGMCU_APBSRFZ_DBG_WWDG2_STOP*/

#if defined(DBGMCU_CRA35_DBG_STGEN_STOP)
#define __HAL_DBGMCU_FREEZE_STGEN()          SET_BIT(DBGMCU->CRA35, DBGMCU_CRA35_DBG_STGEN_STOP)
#define __HAL_DBGMCU_UNFREEZE_STGEN()        CLEAR_BIT(DBGMCU->CRA35, DBGMCU_CRA35_DBG_STGEN_STOP)
#endif /*DBGMCU_CRA35_DBG_STGEN_STOP*/
#elif defined (CORE_CM33)
#if defined(DBGMCU_AHB2LFZ_DBG_HPDMA1_CH0_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA1_CH0()     SET_BIT(DBGMCU->AHB2LFZ2, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH0_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA1_CH0()   CLEAR_BIT(DBGMCU->AHB2LFZ2, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH0_STOP)
#endif /*DBGMCU_AHB2LFZ_DBG_HPDMA1_CH0_STOP*/

#if defined(DBGMCU_AHB2LFZ_DBG_HPDMA1_CH1_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA1_CH1()     SET_BIT(DBGMCU->AHB2LFZ2, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH1_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA1_CH1()   CLEAR_BIT(DBGMCU->AHB2LFZ2, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH1_STOP)
#endif /*DBGMCU_AHB2LFZ_DBG_HPDMA1_CH1_STOP*/

#if defined(DBGMCU_AHB2LFZ_DBG_HPDMA1_CH2_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA1_CH2()     SET_BIT(DBGMCU->AHB2LFZ2, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH2_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA1_CH2()   CLEAR_BIT(DBGMCU->AHB2LFZ2, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH2_STOP)
#endif /*DBGMCU_AHB2LFZ_DBG_HPDMA1_CH2_STOP*/

#if defined(DBGMCU_AHB2LFZ_DBG_HPDMA1_CH3_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA1_CH3()     SET_BIT(DBGMCU->AHB2LFZ2, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH3_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA1_CH3()   CLEAR_BIT(DBGMCU->AHB2LFZ2, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH3_STOP)
#endif /*DBGMCU_AHB2LFZ_DBG_HPDMA1_CH3_STOP*/

#if defined(DBGMCU_AHB2LFZ_DBG_HPDMA1_CH4_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA1_CH4()     SET_BIT(DBGMCU->AHB2LFZ2, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH4_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA1_CH4()   CLEAR_BIT(DBGMCU->AHB2LFZ2, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH4_STOP)
#endif /*DBGMCU_AHB2LFZ_DBG_HPDMA1_CH4_STOP*/

#if defined(DBGMCU_AHB2LFZ_DBG_HPDMA1_CH5_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA1_CH5()     SET_BIT(DBGMCU->AHB2LFZ2, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH5_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA1_CH5()   CLEAR_BIT(DBGMCU->AHB2LFZ2, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH5_STOP)
#endif /*DBGMCU_AHB2LFZ_DBG_HPDMA1_CH5_STOP*/

#if defined(DBGMCU_AHB2LFZ_DBG_HPDMA1_CH6_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA1_CH6()     SET_BIT(DBGMCU->AHB2LFZ2, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH6_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA1_CH6()   CLEAR_BIT(DBGMCU->AHB2LFZ2, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH6_STOP)
#endif /*DBGMCU_AHB2LFZ_DBG_HPDMA1_CH6_STOP*/

#if defined(DBGMCU_AHB2LFZ_DBG_HPDMA1_CH7_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA1_CH7()     SET_BIT(DBGMCU->AHB2LFZ2, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH7_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA1_CH7()   CLEAR_BIT(DBGMCU->AHB2LFZ2, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH7_STOP)
#endif /*DBGMCU_AHB2LFZ_DBG_HPDMA1_CH7_STOP*/

#if defined(DBGMCU_AHB2LFZ_DBG_HPDMA1_CH8_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA1_CH8()     SET_BIT(DBGMCU->AHB2LFZ2, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH8_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA1_CH8()   CLEAR_BIT(DBGMCU->AHB2LFZ2, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH8_STOP)
#endif /*DBGMCU_AHB2LFZ_DBG_HPDMA1_CH8_STOP*/

#if defined(DBGMCU_AHB2LFZ_DBG_HPDMA1_CH9_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA1_CH9()     SET_BIT(DBGMCU->AHB2LFZ2, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH9_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA1_CH9()   CLEAR_BIT(DBGMCU->AHB2LFZ2, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH9_STOP)
#endif /*DBGMCU_AHB2LFZ_DBG_HPDMA1_CH9_STOP*/

#if defined(DBGMCU_AHB2LFZ_DBG_HPDMA1_CH10_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA1_CH10()    SET_BIT(DBGMCU->AHB2LFZ2, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH10_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA1_CH10()  CLEAR_BIT(DBGMCU->AHB2LFZ2, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH10_STOP)
#endif /*DBGMCU_AHB2LFZ_DBG_HPDMA1_CH10_STOP*/

#if defined(DBGMCU_AHB2LFZ_DBG_HPDMA1_CH11_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA1_CH11()    SET_BIT(DBGMCU->AHB2LFZ2, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH11_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA1_CH11()  CLEAR_BIT(DBGMCU->AHB2LFZ2, DBGMCU_AHB2LFZ_DBG_HPDMA1_CH11_STOP)
#endif /*DBGMCU_AHB2LFZ_DBG_HPDMA1_CH11_STOP*/

