zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal.h
#if defined(DBGMCU_APB3FZ_DBG_IWDG4_STOP)
#define __HAL_DBGMCU_FREEZE_IWDG4()          SET_BIT(DBGMCU->APB3FZ2, DBGMCU_APB3FZ_DBG_IWDG4_STOP)
#define __HAL_DBGMCU_UNFREEZE_IWDG4()        CLEAR_BIT(DBGMCU->APB3FZ2, DBGMCU_APB3FZ_DBG_IWDG4_STOP)
#endif /*DBGMCU_APB3FZ_DBG_IWDG4_STOP*/

#if defined(DBGMCU_APB3FZ_DBG_WWDG1_STOP)
#define __HAL_DBGMCU_FREEZE_WWDG1()          SET_BIT(DBGMCU->APB3FZ2, DBGMCU_APB3FZ_DBG_WWDG1_STOP)
#define __HAL_DBGMCU_UNFREEZE_WWDG1()        CLEAR_BIT(DBGMCU->APB3FZ2, DBGMCU_APB3FZ_DBG_WWDG1_STOP)
#endif /*DBGMCU_APB3FZ_DBG_WWDG1_STOP*/

#if defined(DBGMCU_APBSRFZ_DBG_RTC_STOP)
#define __HAL_DBGMCU_FREEZE_RTC()           SET_BIT(DBGMCU->APBSRFZ2, DBGMCU_APBSRFZ_DBG_RTC_STOP)
#define __HAL_DBGMCU_UNFREEZE_RTC()         CLEAR_BIT(DBGMCU->APBSRFZ2, DBGMCU_APBSRFZ_DBG_RTC_STOP)
#endif /*DBGMCU_APBSRFZ_DBG_RTC_STOP*/

#if defined(DBGMCU_APBSRFZ_DBG_I2C8_STOP)
#define __HAL_DBGMCU_FREEZE_I2C8()           SET_BIT(DBGMCU->APBSRFZ2, DBGMCU_APBSRFZ_DBG_I2C8_STOP)
#define __HAL_DBGMCU_UNFREEZE_I2C8()         CLEAR_BIT(DBGMCU->APBSRFZ2, DBGMCU_APBSRFZ_DBG_I2C8_STOP)
#endif /*DBGMCU_APBSRFZ_DBG_I2C8_STOP*/

#if defined(DBGMCU_APBSRFZ_DBG_I3C4_STOP)
#define __HAL_DBGMCU_FREEZE_I3C4()           SET_BIT(DBGMCU->APBSRFZ2, DBGMCU_APBSRFZ_DBG_I3C4_STOP)
#define __HAL_DBGMCU_UNFREEZE_I3C4()         CLEAR_BIT(DBGMCU->APBSRFZ2, DBGMCU_APBSRFZ_DBG_I3C4_STOP)
#endif /*DBGMCU_APBSRFZ_DBG_I3C4_STOP*/

#if defined(DBGMCU_APBSRFZ_DBG_LPTIM3_STOP)
#define __HAL_DBGMCU_FREEZE_LPTIM3()         SET_BIT(DBGMCU->APBSRFZ2, DBGMCU_APBSRFZ_DBG_LPTIM3_STOP)
#define __HAL_DBGMCU_UNFREEZE_LPTIM3()       CLEAR_BIT(DBGMCU->APBSRFZ2, DBGMCU_APBSRFZ_DBG_LPTIM3_STOP)
#endif /*DBGMCU_APBSRFZ_DBG_LPTIM3_STOP*/

#if defined(DBGMCU_APBSRFZ_DBG_LPTIM4_STOP)
#define __HAL_DBGMCU_FREEZE_LPTIM4()         SET_BIT(DBGMCU->APBSRFZ2, DBGMCU_APBSRFZ_DBG_LPTIM4_STOP)
#define __HAL_DBGMCU_UNFREEZE_LPTIM4()       CLEAR_BIT(DBGMCU->APBSRFZ2, DBGMCU_APBSRFZ_DBG_LPTIM4_STOP)
#endif /*DBGMCU_APBSRFZ_DBG_LPTIM4_STOP*/

#if defined(DBGMCU_APBSRFZ_DBG_LPTIM5_STOP)
#define __HAL_DBGMCU_FREEZE_LPTIM5()         SET_BIT(DBGMCU->APBSRFZ2, DBGMCU_APBSRFZ_DBG_LPTIM5_STOP)
#define __HAL_DBGMCU_UNFREEZE_LPTIM5()       CLEAR_BIT(DBGMCU->APBSRFZ2, DBGMCU_APBSRFZ_DBG_LPTIM5_STOP)
#endif /*DBGMCU_APBSRFZ_DBG_LPTIM5_STOP*/

#if defined(DBGMCU_APBSRFZ_DBG_WWDG2_STOP)
#define __HAL_DBGMCU_FREEZE_WWDG2()          SET_BIT(DBGMCU->APBSRFZ2, DBGMCU_APBSRFZ_DBG_WWDG2_STOP)
#define __HAL_DBGMCU_UNFREEZE_WWDG2()        CLEAR_BIT(DBGMCU->APBSRFZ2, DBGMCU_APBSRFZ_DBG_WWDG2_STOP)
#endif /*DBGMCU_APBSRFZ_DBG_WWDG2_STOP*/

#if defined(DBGMCU_APBSRFZ_DBG_RTC_STOP)
#define __HAL_DBGMCU_C3_FREEZE_RTC()         SET_BIT(DBGMCU->APBSRFZ3, DBGMCU_APBSRFZ_DBG_RTC_STOP)
#define __HAL_DBGMCU_C3_UNFREEZE_RTC()       CLEAR_BIT(DBGMCU->APB1FZ3, DBGMCU_APBSRFZ_DBG_RTC_STOP)
#endif /*DBGMCU_APBSRFZ_DBG_RTC_STOP*/

#if defined(DBGMCU_APBSRFZ_DBG_I2C8_STOP)
#define __HAL_DBGMCU_C3_FREEZE_I2C8()        SET_BIT(DBGMCU->APBSRFZ3, DBGMCU_APBSRFZ_DBG_I2C8_STOP)
#define __HAL_DBGMCU_C3_UNFREEZE_I2C8()      CLEAR_BIT(DBGMCU->APBSRFZ3, DBGMCU_APBSRFZ_DBG_I2C8_STOP)
#endif /*DBGMCU_APBSRFZ_DBG_I2C8_STOP*/

#if defined(DBGMCU_APBSRFZ_DBG_I3C4_STOP)
#define __HAL_DBGMCU_C3_FREEZE_I3C4()        SET_BIT(DBGMCU->APBSRFZ3, DBGMCU_APBSRFZ_DBG_I3C4_STOP)
#define __HAL_DBGMCU_C3_UNFREEZE_I3C4()      CLEAR_BIT(DBGMCU->APBSRFZ3, DBGMCU_APBSRFZ_DBG_I3C4_STOP)
#endif /*DBGMCU_APBSRFZ_DBG_I3C4_STOP*/

#if defined(DBGMCU_APBSRFZ_DBG_LPTIM3_STOP)
#define __HAL_DBGMCU_C3_FREEZE_LPTIM3()      SET_BIT(DBGMCU->APBSRFZ3, DBGMCU_APBSRFZ_DBG_LPTIM3_STOP)
#define __HAL_DBGMCU_C3_UNFREEZE_LPTIM3()    CLEAR_BIT(DBGMCU->APBSRFZ3, DBGMCU_APBSRFZ_DBG_LPTIM3_STOP)
#endif /*DBGMCU_APBSRFZ_DBG_LPTIM3_STOP*/

#if defined(DBGMCU_APBSRFZ_DBG_LPTIM4_STOP)
#define __HAL_DBGMCU_C3_FREEZE_LPTIM4()      SET_BIT(DBGMCU->APBSRFZ3, DBGMCU_APBSRFZ_DBG_LPTIM4_STOP)
#define __HAL_DBGMCU_C3_UNFREEZE_LPTIM4()    CLEAR_BIT(DBGMCU->APBSRFZ3, DBGMCU_APBSRFZ_DBG_LPTIM4_STOP)
#endif /*DBGMCU_APBSRFZ_DBG_LPTIM4_STOP*/

#if defined(DBGMCU_APBSRFZ_DBG_LPTIM5_STOP)
#define __HAL_DBGMCU_C3_FREEZE_LPTIM5()      SET_BIT(DBGMCU->APBSRFZ3, DBGMCU_APBSRFZ_DBG_LPTIM5_STOP)
#define __HAL_DBGMCU_C3_UNFREEZE_LPTIM5()    CLEAR_BIT(DBGMCU->APBSRFZ3, DBGMCU_APBSRFZ_DBG_LPTIM5_STOP)
#endif /*DBGMCU_APBSRFZ_DBG_LPTIM4_STOP*/

#if defined(DBGMCU_APBSRFZ_DBG_IWDG5_STOP)
#define __HAL_DBGMCU_C3_FREEZE_IWDG5()       SET_BIT(DBGMCU->APBSRFZ3, DBGMCU_APBSRFZ_DBG_IWDG5_STOP)
#define __HAL_DBGMCU_C3_UNFREEZE_IWDG5()     CLEAR_BIT(DBGMCU->APBSRFZ3, DBGMCU_APBSRFZ_DBG_IWDG5_STOP)
#endif /*DBGMCU_APBSRFZ_DBG_IWDG5_STOP*/

#if defined(DBGMCU_APBSRFZ_DBG_WWDG2_STOP)
#define __HAL_DBGMCU_C3_FREEZE_WWDG2()       SET_BIT(DBGMCU->APBSRFZ3, DBGMCU_APBSRFZ_DBG_WWDG2_STOP)
#define __HAL_DBGMCU_C3_UNFREEZE_WWDG2()     CLEAR_BIT(DBGMCU->APBSRFZ3, DBGMCU_APBSRFZ_DBG_WWDG2_STOP)
#endif /*DBGMCU_APBSRFZ_DBG_WWDG2_STOP*/
#endif /* Cores */

/**
  * @}
  */

/** @defgroup SYSCFG_Exported_Macros SYSCFG Exported Macros
  * @{
  */
#if defined(CORE_CA35) || defined(CORE_CM33)
/** @brief  Floating Point Unit interrupt enable/disable macros
  * @param __INTERRUPT__  This parameter can be a value of @ref SYSCFG_FPU_Interrupts
  *   @arg SYSCFG_IT_FPU_IDC
  *   @arg SYSCFG_IT_FPU_IXC
  *   @arg SYSCFG_IT_FPU_UFC
  *   @arg SYSCFG_IT_FPU_OFC
  *   @arg SYSCFG_IT_FPU_DZC
  *   @arg SYSCFG_IT_FPU_IOC
  */
#define __HAL_SYSCFG_FPU_INTERRUPT_ENABLE(__INTERRUPT__)    do {assert_param(IS_SYSCFG_FPU_INTERRUPT((__INTERRUPT__)));\
                                                                 SET_BIT(SYSCFG->M33SSCR, (__INTERRUPT__));\
                                                               }while(0)

#define __HAL_SYSCFG_FPU_INTERRUPT_DISABLE(__INTERRUPT__)   do {assert_param(IS_SYSCFG_FPU_INTERRUPT((__INTERRUPT__)));\
                                                                 CLEAR_BIT(SYSCFG->M33SSCR, (__INTERRUPT__));\
                                                               }while(0)
#endif /* CORE_CA35 || CORE_CM33 */
/**
  * @}
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @addtogroup HAL_Exported_Functions
  * @{
  */

