zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal.h
/** @addtogroup HAL_Exported_Functions_Group1
  * @{
  */
/* Initialization and de-initialization functions  ******************************/
HAL_StatusTypeDef     HAL_Init(void);
HAL_StatusTypeDef     HAL_DeInit(void);
void                  HAL_MspInit(void);
void                  HAL_MspDeInit(void);
HAL_StatusTypeDef     HAL_InitTick(uint32_t TickPriority);
/**
  * @}
  */

/** @addtogroup HAL_Exported_Functions_Group2
  * @{
  */
/* Peripheral Control functions  ************************************************/
void                  HAL_IncTick(void);
void                  HAL_Delay(__IO uint32_t Delay);
uint32_t              HAL_GetTick(void);
void                  HAL_SuspendTick(void);
void                  HAL_ResumeTick(void);
uint32_t              HAL_GetHalVersion(void);
#if defined(CORE_CA35) || defined(CORE_CM33)
uint32_t              HAL_GetREVID(void);
uint32_t              HAL_GetDEVID(void);
uint32_t              HAL_GetUIDw0(void);
uint32_t              HAL_GetUIDw1(void);
uint32_t              HAL_GetUIDw2(void);
/**
  * @}
  */

/** @addtogroup HAL_Exported_Functions_Group3
  * @{
  */

/* DBGMCU Peripheral Control functions  ***************************************/
void                  HAL_DBGMCU_EnableWatchdogTimer2CA35Freeze(void);
void                  HAL_DBGMCU_DisableWatchdogTimer2CA35Freeze(void);
void                  HAL_DBGMCU_EnableDBGSleepMode(void);
void                  HAL_DBGMCU_DisableDBGSleepMode(void);
void                  HAL_DBGMCU_EnableDBGStopMode(void);
void                  HAL_DBGMCU_DisableDBGStopMode(void);
void                  HAL_DBGMCU_EnableDBGStandbyMode(void);
void                  HAL_DBGMCU_DisableDBGStandbyMode(void);
/**
  * @}
  */

/** @addtogroup HAL_Exported_Functions_Group4
  * @{
  */
/* SYSCFG Peripheral Control functions  ***************************************/
void                  HAL_HDP_DisableHDP(void);
void                  HAL_HDP_EnableHDP(void);
void                  HAL_HDP_ConfigHDPMux(uint32_t HDP_Mux, uint32_t HDP_Signal);
void                  HAL_HDP_WriteGPOVAL(uint32_t GPOVAL_value);
uint32_t              HAL_HDP_ReadVAL(void);
/**
  * @}
  */

/** @addtogroup HAL_Exported_Functions_Group5
  * @{
  */

/* SYSCFG Peripheral Control functions  ***************************************/
void                  HAL_SYSCFG_ETH1InterfaceSelect(uint32_t SYSCFG_ETHInterface);
void                  HAL_SYSCFG_ETH2InterfaceSelect(uint32_t SYSCFG_ETHInterface);
void                  HAL_SYSCFG_ETH1ClockSelect(uint32_t SYSCFG_ETHClock);
void                  HAL_SYSCFG_ETH2ClockSelect(uint32_t SYSCFG_ETHClock);
void                  HAL_SYSCFG_ETH1RefClockSelect(uint32_t SYSCFG_ETHClock);
void                  HAL_SYSCFG_ETH2RefClockSelect(uint32_t SYSCFG_ETHClock);
void                  HAL_SYSCFG_AnalogSwitchConfig(uint32_t SYSCFG_AnalogSwitch, uint32_t SYSCFG_SwitchState);
void                  HAL_SYSCFG_EnableIOSpeedOptimize(uint32_t SYSCFG_HighSpeedSignal);
void                  HAL_SYSCFG_DisableIOSpeedOptimize(uint32_t SYSCFG_HighSpeedSignal);
void                  HAL_SYSCFG_Lock(uint32_t Item);
HAL_StatusTypeDef     HAL_SYSCFG_GetLock(uint32_t *pItem);
/**
  * @}
  */
#endif /* CORE_CA35 || CORE_CM33 */
/**
  * @}
  */

/**
  * @}
  */
/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __STM32MP2xx_HAL_H */
